//**************************************************
// 
// FPG制作 ( texture.h )
// Author  : katsuki mizuki
// 
//**************************************************
#ifndef _TEXTURE_H_	//このマクロ定義がされてなかったら
#define _TEXTURE_H_	//２重インクルード防止のマクロ定義

//==================================================
// 列挙型
//==================================================
typedef enum
{
	//タイトル画面
	TEXTURE_TITLE_BG,		// タイトル画面の背景

	//ゲーム画面
	TEXTURE_GAME_BG,		// ゲーム画面の背景
	TEXTURE_BOM,			//爆弾
	TEXTURE_BALLOONBOM,		//風船付き爆弾
	TEXTURE_FLOWER,			//花
	TEXTURE_FOX_UFO,		//UFO in きつね
	TEXTURE_LIGHT_BRIGHT,	//明るい街灯
	TEXTURE_LIGHT_DARK,		//暗い街灯

	//リザルト画面
	TEXTURE_RESULT_BG,		// リザルト画面の背景

	TEXTURE_MAX,
	TEXTURE_NONE,
}TEXTURE;

//==================================================
// プロトタイプ宣言
//==================================================
//--------------------------------------------------
// 読み込み
//--------------------------------------------------
void LoadTexture(void);

//--------------------------------------------------
// 終了
//--------------------------------------------------
void UninitTexture(void);

//--------------------------------------------------
// 取得
// 引数  : TEXTURE texture / 列挙型 種類
// 返値  : LPDIRECT3DTEXTURE9 / テクスチャ
//--------------------------------------------------
LPDIRECT3DTEXTURE9 GetTexture(TEXTURE texture);

#endif // !_TEXTURE_H_
